demo-output/website/dafoam/f6b_periodic_hills/case_breuer_re10595/system/singleGraph_x5
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

#include "../fieldDef"

start   (5 0 0);
end     (5 3.035 0);

// Fields not available in a given solver will be ignored
fields  $singleGraphFields;

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.
setConfig
{
  type midPoint;   //lineUniform, lineCell, lineCellFace
  axis xyz;  // x, y, z, xyz
}


// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
